// - 1 - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

/*let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
friends = friends.length;
console.log(friends);
if (friends >= 3) {
    console.log("Це великий масив в якому 3 і більше елементи");
}   else {
    console.log("Це маленький масив в якому менше 3-ч елементів");
}*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - 2  - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//  Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.
/*
let a = 20;
let b = 15;
let c = 25;



if (a > b && a < c || a < b && a > c) {
    console.log( a + " - це число є середнім.");
} else if (b > a && b < c || b < a && b > c) {
    console.log( b + " - це число є середнім.");
} else if (c > a && c < b || c < a && c > b) {
    console.log(c + " - це число є середнім.");
} else {
    console.log("Щось пішло не так :(");
}
let arrayOfNumbers = [a, b, c];

if (a===arrayOfNumbers[1]){
    console.log(a + " - це число знаходиться між двома іншимию");
} else if (b === arrayOfNumbers[1]) {
    console.log(b + " - це число знаходиться між двома іншимию");
} else if (c === arrayOfNumbers[1]) {
    console.log(c + " - це число знаходиться між двома іншимию");
} else if (a !== arrayOfNumbers[1]) {
    console.log(a + " - це число не знаходиться між двома іншимию");
} else if (b !== arrayOfNumbers[1]) {
    console.log(b + " - це число не знаходиться між двома іншимию");
} else if (c !== arrayOfNumbers[1]) {
    console.log(c + " - це число не знаходиться між двома іншимию");
} else {
    console.log("Щось пішло не так...");
}*/

//Робила декілька варіантів, але так і не вийшло вивести інформацію тільки по середньому числі та чи знаходиться воно між іншими.
//Залишила той варіант, який мені найадекватніший зі всіх здається
//Можливо, я щось не так в завданні зрозуміла, підкажіть , будь ласка, як би то мало бути правильно.


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - 3  - Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }


/*
/!*let a = 1;
let b = 2;*!/
let a = 5;
let b = 2;

let result = (a + b < 4) ? "Мало": "Багато";
console.log(result);*/


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - 4  - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

/*let number = +prompt("Введіть будь-яке число від -100 до 100 включно");
let yourNumber = (number > 0) ? "Ви ввели позитивне число" : " Ви ввели 0, або негативне число";
console.log(yourNumber);*/

//Не впевнена, що правильно зрозуміла завдання
//Наскільки розумію, що за допомогою тернарки, можемо визначити лише true або false
//Тому знайшла таке вирішення задачі, як є кращий варіант, то чекатиму на коментарі)))
