//- 1 -  Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

/*
let a = +prompt("Введіть число № 1");
let b = +prompt("Введіть число № 2");

if (a>b){
    console.log( "З двох введених Вами чисел число " + a + " має максимальне значення.");
    document.write(`<h1> З двох введених Вами чмсел число ${a} має максимальне значення</h1>`);
} else if (a<b){
    console.log( "З двох введених Вами чисел число " + b + " має максимальне значення");
    document.write(`<h1> З двох введених Вами чмсел число ${b} має максимальне значення</h1>`);
} else if(a===b){
    console.log("Ви ввели два однакові числа.");
    document.write(`<h1> Ви ввели два однакові числа. </h1>`);
} else {
    console.log("Спробуйте ще раз. Перевірте чи внесені Вами дані являються числами!");
    document.write(`<h1> Спробуйте ще раз. Перевірте чи внесені Вами дані являються числами! </h1>`);
}*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////

// - 2  - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

/*let flat = +prompt("Введіть номер вашої квартири.")

if(flat>=1 && flat<=20){
    console.log("Ви живете у першому під'їзді.");
    document.write(`<h2> Ви живете у першому під'їзді. </h2>`);
}
 else if(flat>=21 && flat<=48) {
    console.log("Ви живете у другому під'їзді.");
    document.write(`<h2> Ви живете у другому під'їзді. </h2>`);
}
 else if(flat>=49 && flat<=90) {
    console.log("Ви живете у третьому під'їзді.");
    document.write(`<h2> Ви живете у третьому під'їзді. </h2>`);
} else{
    console.log("Перевірте чи ввели коректний номер квартири. Дані потрібно вносити цифрами.");
    document.write(`<h2> Перевірте чи ввели коректний номер квартири. Дані потрібно вносити цифрами. </h2>`);
}*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////

// - 3 - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
/*

let number = +prompt("Давай зіграємо у гру. Спробуй відгадати, яке число ми загадали. Трохи тобі допоможемо, число знаходиться в діапазоні від 1 до 10 включно.")
if (number===10){
    console.log("ВІРНО. Ти виграв!!!");
    document.write(`<h2> ВІРНО. Ти виграв!!! </h2>`);
} else{
    console.log("НЕВІРНО. Спробуй ще, все в твоїх руках!");
    document.write(`<h2> НЕВІРНО. Спробуй ще, все в твоїх руках! </h2>`);
}*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////

// - 4 - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else

/* let someVar = 0;

if (typeof someVar == "number") {
    console.log(1 + " - В змінну вписане число.");
} else if (typeof someVar == "string"){
    console.log(2 + " - В змінну вписана стрінга.");
}else if (typeof someVar == "boolean") {
    console.log(3 + " - В змінну вписанe булеве значення.");
}
else if (typeof someVar == "object") {
    console.log(4 + " - В змінну вписаний об'єкт або масив.");
}*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////

// - 5 - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

/*
let t = +prompt("Чи ми йдемо сьогодні в OKTEN на навчання? Щоб дізнатись відповідь введи у поле яка температура повітря в тебе за вікном. Дані введи цифрами :)");

if(t>=10 && t<=22){
    console.log("Ми йдемо вчитися!!!");
    document.write("Ми йдемо вчитися!!!");
}else{
    console.log("Ми сидимо вдома і вчимося ОНЛАЙН :(");
    document.write("Ми сидимо вдома і вчимося ОНЛАЙН :(");
}*/

//////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////////////////////////

// - 6  - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

/*
let startTheGame = +prompt("Перевір свою удачу! Візьми участь у вікторині! Введи у поле число від 1 до 5 включно. ")
switch (startTheGame){
    case 1:
        console.log("Авто. Ти виграв!!!");
        document.write(`<h2> Авто. Ти виграв!!! </h2>`);
        break;
        case 2:
        console.log("Мото. Ти виграв!!!");
        document.write(`<h2> Мото. Ти виграв!!! </h2>`);
        break;
        case 3:
        console.log("Телефон. Ти виграв!!!");
        document.write(`<h2> Телефон. Ти виграв!!! </h2>`);
        break;
        case 4:
        console.log("Спробуй ще.");
        document.write(`<h2> Спробуй ще. </h2>`);
        break;
        case 5:
        console.log("На жаль сьогодні ти нічого не виграв");
        document.write(`<h2> На жаль сьогодні ти нічого не виграв </h2>`);
        break;
    default :
        console.log(" Число невірне");
        document.write(`<h2>  Число невірне </h2>`);
}*/
