

///=======тут завдання з текстового файлу, підключені у html файлі main=======//////////

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
let array = [2,17,13,6,22,31,45,66,100,-18];
console.log(array);

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 1. перебрати його циклом while

/*let i = 0;
while(i<array.length){
    console.log(array [i]);
    document.write(`<p>${array[i]}</p>`);
    i++;
}*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//2. перебрати його циклом for

/*for( let arr of array){
    console.log(arr);
    document.write(`<div>`);
    document.write(arr);
    document.write(`</div>`);
}*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//3. перебрати циклом while та вивести  числа тільки з непарним індексом

/*let i=0;
while(i<array.length){
    if(i%2!==0){
        console.log(array[i]);
        document.write(`<div>${array[i]}</div>`);
    }
    i++;
}*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//4. перебрати циклом for та вивести  числа тільки з непарним індексом

/*for(i=0; i<array.length; i++){
    if(i%2 !==0){
        console.log(array[i]);
    }
}*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//5. перебрати циклом while та вивести  числа тільки парні  значення

/*
let i = 0;
while (i<array.length){
    if(i%2===0){
        console.log(array[i]);
    }
    i++;
}*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//6. перебрати циклом for та вивести  числа тільки парні  значення

/*for( i= 0; i<array.length; i++){
    if(i%2===0){
        console.log(array[i]);
    }
}*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//7. замінити кожне число кратне 3 на слово "okten"

/*for(let arr of array){
    if(arr%3 ===0){
        arr = "okten";// уточніть чи правильно розумію, якщо в {області видимості} створити let, її не буде видно, і це неправильно, але переприсвоювати значення ми можемо? так як тут з arr?
    }
    console.log(arr);
    document.write(`<p>`);
    document.write(arr);
    document.write(`</p>`);
}*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 8. вивести масив в зворотньому порядку.

/*for (let i = array.length - 1; i >= 0; i--) {
    let arrayElement = array[i];
    console.log(arrayElement);
    document.write(`<div>`);
    document.write(arrayElement);
    document.write(`</div>`);

}*/

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

//           1


/*let i = array.length-1;
while (i>=0){
    console.log(array[i]);
    i--;
}*/


//           2

/*for (let i = array.length - 1; i >= 0; i--) {
    let arrayElement = array[i];
   console.log(arrayElement);
    document.write(`<div>`);
    document.write(arrayElement);
    document.write(`</div>`);
}*/

//           3

/*let i=array.length-1;
while(i>=0){
    if(i%2!==0){
        console.log(array[i]);
        document.write(`<div>${array[i]}</div>`);
    }
    i--;
}*/

//           4

/*
for(i=array.length-1; i>=0; i--){
    if(i%2 !==0){
        console.log(array[i]);
    }
}*/

//           5

/*let i = array.length-1;
while (i>=0){
    if(i%2===0){
        console.log(array[i]);
    }
    i--;
}*/

//           6

/*for( i= array.length-1; i>=0; i--){
    if(i%2===0){
        console.log(array[i]);
    }
}*/

//           7

for(i=array.length-1; i>=0; i--){
    if(array[i] % 3 ===0){
        array[i]= "okten";
    }
    console.log(array[i])
}