//  1 - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).
/*
let time = +prompt ("Введіть число від 0 до 59");
if (time >= 0 && time <= 14) {
    document.write ("<h1> Число попадає в першу частину години. </h1>");
    console.log("Число попадає в першу частину години.");
} else if (time >14 && time <= 29){
    document.write ("<h1> Число попадає в другу частину години. </h1>");
    console.log("Число попадає в другу частину години.");
}  else if (time >29 && time <= 44){
    document.write ("<h1> Число попадає в третю частину години. </h1>");
    console.log("Число попадає в третю частину години.");
} else if (time > 44 && time <= 59){
    document.write ("<h1> Число попадає в четверту частину години. </h1>");
    console.log("Число попадає в четверту частину години.");
} else {
    document.write ("<h1> Ви ввели неправильне число. Воно не входить в межі діапазону від 0 до 59 </h1>");
    console.log("Ви ввели неправильне число. Воно не входить в межі діапазону від 0 до 59");
}*/
// Маю питання, чому, якщо залишаю поле вводу пустим і натискаю ок чи відміна мені видає цей текст "Число попадає в першу частину години.", така сама ситуація відбувається, коли ввожу число більше 14 і натискаю на відміну.


/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 2 - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

/*
let day = Math.floor(Math.random()*31+1);//тут// я додала 1, щоб не було 0 і було 31, це правильно?бо не впевнена що правильно розумію роботу цих функцій
document.write (day);
console.log(day);

if (day >= 1 && day <= 10) {
    document.write ("<h1> Це число попадає у першу декаду місяця. </h1>");
    console.log("Це число попадає у першу декаду місяця.");
} else if (day >10 && day <= 20){
    document.write ("<h1> Це число попадає у другу декаду місяця. </h1>");
    console.log("Це число попадає у другу декаду місяця.");
}  else if (day >20 && day <= 31){
    document.write ("<h1> Це число попадає у третю декаду місяця. </h1>");
    console.log("Це число попадає у третю декаду місяця.");
} else {
    document.write ("<h1> Щось пішло не так :( </h1>");
    console.log("Щось пішло не так :(");
}*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 3 - У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

/*
let test1 = true ? "Неправильно" : "Вірно"; //Зразу уточню, чи я правильно зрозуміла: Якщо в завданні сказано: ""Неправильно" : "Вірно";" тобто при тру має бути відповідь Неправильно, а при фолс Вірно?
console.log(test1);

let test2 = false ? "Неправильно" : "Вірно";
console.log(test2);

let test3 = !true ? "Неправильно" : "Вірно";
console.log(test3);

let test4 = !false ? "Неправильно" : "Вірно";
console.log(test4);*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////


// 4 - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
/*
//let a = !0 ? "Вірно" : "Невірно";
//let a = 0 ? "Вірно" : "Невірно";
//let a = 1 ? "Вірно" : "Невірно";
let a = -3 ? "Вірно" : "Невірно";

console.log(a);*/

// або ще таким чином

//let a = !0; let a = -3; let a = 1; let a = 0;
/*let a = -3;
if (a<0 || a>0){
    console.log("Вірно");
} else {
    console.log("Невірно");
}*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 5 - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

/*

let myDailyPlans =  prompt ("Введіть порядковий номер дня тижня: число від 1 до 7");
switch (myDailyPlans){
    case "1":
        console.log ("1 jhugyguhi");
        break;

         case "2":
        console.log ("2 jhugyguhi");
        break;

         case "3":
        console.log ("3 jhugyguhi");
        break;
         case "4":
        console.log ("4 jhugyguhi");
        break;
         case "5":
        console.log ("5 jhugyguhi");
        break;
         case "6":
        console.log ("6 jhugyguhi");
        break;
         case "7":
        console.log ("7 jhugyguhi");
        break;

    default:
        console.log ("Звертаємо Вашу увагу числа мають бути від 1 до 7!!!");
}
*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 6 - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

/*let year = +prompt ("Щоб визначити чи високосний рік введіть рік, який Вас цікавить");
year = year%4;
if (year > 0){
    document.write ("<h1> Цей рік невисокосний. </h1>");
    console.log("Цей рік невисокосний.");
} else {
    document.write ("<h1> Цей рік високосний. </h1>");
    console.log("Цей рік високосний.")
}*/


/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 7 - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let nameOfJS = prompt ("Яка «офіційна» назва JavaScript?");

if (nameOfJS === "ECMAScript"){
    document.write ("<h1> Правильно! </h1>");
    console.log("Правильно!");
} else {
    document.write("<h1> Не знаєте? ECMAScript! </h1>");
    console.log("Не знаєте? ECMAScript!");
}