//Всі функції повинні бути описані стрілочним типом!!!!
// - створити функцію яка обчислює та повертає площу прямокутника висотою

let areaOfRectangle = (a, b) => a * b;// я правильно розумію, що тут return не потрібен?функція це сама розуміє?
console.log(areaOfRectangle(5, 8));

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка обчислює та повертає площу кола

let areaOfCircle = (r) => Math.PI * Math.pow(r, 2)
console.log(areaOfCircle(10));

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка обчислює та повертає площу циліндру

let areaOfCylinder = (r, h) => 2 * Math.PI * r * h;
console.log(areaOfCylinder(10, 20));

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка приймає масив та виводить кожен його елемент



let arrayFn = (array) =>{
   for( let i = 0; i < array.length; i++){
       console.log(array[i]);
   }
}
arrayFn([10, 20, 30, 40, 50]);// тут [], потрібно ставити завжди, я правильно розумію?

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент

let someText = (text) => document.write(`<p>${text}</p>`);
someText("Arrow functions :)")

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

let createList = (text) => {
    document.write(`<ul>`);
    document.write(`<li>${text}</li>`);
    document.write(`<li>${text}</li>`);
    document.write(`<li>${text}</li>`);
    document.write(`</ul>`);
}
createList("Some item");

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)


let createList2 = (text, length) => {
    document.write(`<ul>`);
    for(let i = 0; i < length; i++){
        document.write(`<li>${text}</li>`);
    }
    document.write(`</ul>`);
}
createList2("Some item of list", 3);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

let primitiveArray = (array) => {
    document.write(`<ul>`);
    for(let i = 0; i < array.length; i++){
        document.write(`<li>${array[i]}</li>`);
    }
    document.write(`</ul>`);
}

primitiveArray([2, 30, 33, "Olia", "Petro", "Olena", true, false]);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.

let arrOfObjFn =(array) => {
for(item of array){
    document.write(`<div>${item["id"]} ${item["name"]} ${item["age"]} </div>`);
}
}

arrOfObjFn([{id: 1, name: 'Olena', age: 33}, {id: 2, name: 'Petro', age: 30}, {id: 3, name: 'Olia', age: 2}]);